contemplation-machine-quickstart.org
#+TITLE: Contemplation Machine Quickstart Guide
#+AUTHOR: Your Name
#+DATE: [2025-05-06]
#+OPTIONS: ^:nil

#+HTML_HEAD_EXTRA:<link rel="stylesheet" href="assets/toc-nav.css" />
#+HTML_HEAD_EXTRA:<script src="assets/toc-nav.js"></script>
HTML Version: [[file+sys:contemplation-machine-quickstart.html]]


* Testing Contemplation Machine from Scratch

** Clone and Set Up Environment
#+begin_src bash
# Create a dedicated test directory to avoid conflicts with existing files
mkdir -p ~/test-meditation-app
cd ~/test-meditation-app
find .

# Clone the repository
git clone https://github.com/andreaswittmann/contemplation-machine.git
# update the local git repository
cd ~/test-meditation-app/contemplation-machine
git pull
git status
# List the files in the repository
ls -la





# Create the environment file from the provided sample
cp .env.sample .env

cat .env
# Meditation App Environment Configuration

bash # create sub-shell so exports will not affect the current shell
export OPENAI_API_KEY=
export OPENAI_API_KEY=sk-12345678
export ELEVENLABS_API_KEY=
export ELEVENLABS_API_KEY=sk-foobarbaz
export PORT=8055
export HOST=0.0.0.0

# create a perl one-liner that replaces the API-Keys with the values of the shell varibales.
perl -pi -e 's/(OPENAI_API_KEY=).*/$1$ENV{OPENAI_API_KEY}/;' .env
perl -pi -e 's/(ELEVENLABS_API_KEY=).*/$1$ENV{ELEVENLABS_API_KEY}/;' .env
perl -pi -e 's/(PORT=).*/$1$ENV{PORT}/;' .env
perl -pi -e 's/(HOST=).*/$1$ENV{HOST}/;' .env
cat .env 
exit # subshell

echo "OPENAI_API_KEY: $OPENAI_API_KEY"
echo "ELEVENLABS_API_KEY: $ELEVENLABS_API_KEY"
echo "PORT: $PORT"
echo "HOST: $HOST"

# Display the environment file contents to verify configuration
cat .env



#+end_src

This clones the repository and creates a basic environment configuration with API keys and port settings.

** Create a Container for local testing.

Now I want to test the application locally. I will use the settings from the .env file to create a container and run it.

#+begin_src bash
# Build the Docker containers with a clean cache to ensure fresh builds
docker-compose build --no-cache

# Start the containers in detached mode to run in the background
docker-compose up -d
docker-compose down --timeout 0


# Verify that the containers are running properly
docker ps | grep contemplation-machine


#+end_src

** Changing Configuration Without Rebuilding

You can change API keys or the external port without rebuilding the container:

#+begin_src bash
# Listing: Testing configuration changes through environment.
#  Override the PORT when starting the container
docker-compose down --timeout 0
PORT=9999 docker-compose up -d
# Check the application is running on the new port
curl http://localhost:9999/api/health

## Change configuration by modifying the .env file
cat .env
# Meditation App Environment Configuration

bash # create sub-shell so exports will not affect the current shell
export OPENAI_API_KEY=
export OPENAI_API_KEY=sk-12345678
export ELEVENLABS_API_KEY=
export ELEVENLABS_API_KEY=sk-foobarbaz
export PORT=8055
export HOST=0.0.0.0

# create a perl one-liner that replaces the API-Keys with the values of the shell varibales.
perl -pi -e 's/(OPENAI_API_KEY=).*/$1$ENV{OPENAI_API_KEY}/;' .env
perl -pi -e 's/(ELEVENLABS_API_KEY=).*/$1$ENV{ELEVENLABS_API_KEY}/;' .env
perl -pi -e 's/(PORT=).*/$1$ENV{PORT}/;' .env
perl -pi -e 's/(HOST=).*/$1$ENV{HOST}/;' .env
cat .env 
exit # subshell

# Restart the container to apply changes
docker-compose down --timeout 0
docker-compose up -d


#+end_src


* Creating Multi-Arch Docker Image

** Build for Multiple Platforms
#+begin_src bash

## Store current version form Version.md
ls -la

cat Version.md
VERSION=$(tr -d '[:space:]' < Version.md)
echo $VERSION

# Optional: Display the content of .env to verify the change
cat .env

# Log in to Docker Hub
docker login


# Set up buildx builder
docker buildx create --name mybuilder --use

# Build and push multi-arch image
docker buildx build --platform linux/amd64,linux/arm64   -t awittmann386/contemplation-machine:latest  --push .
docker buildx build --platform linux/amd64,linux/arm64   -t awittmann386/contemplation-machine:$VERSION  --push .
#+end_src

This builds Docker images for both AMD64 (standard computers) and ARM64 (Apple Silicon, etc.) architectures and pushes them to Docker Hub.

* Testing Docker Hub Image via Command Line

** Pull and Run from Docker Hub
#+begin_src bash
# Create data directory for persistence
mkdir -p ./contemplation-data

# Create a simple .env file with your API keys and desired port
cat > ~/contemplation-env << EOF
OPENAI_API_KEY=your_openai_key_here
ELEVENLABS_API_KEY=your_elevenlabs_key_here
PORT=8088
EOF

# Run the container with the .env file mounted
docker run -d \
  --name meditation \
  -p 8088:3001 \
  -v ~/contemplation-data:/app/data \
  -v ~/contemplation-env:/app/.env \
  yourusername/contemplation-machine:latest
#+end_src

The application should now be running and accessible at http://localhost:8088 (or whatever port you specified).

** Using the Docker Desktop Default Port

When downloading and running the container from Docker Hub via Docker Desktop:

1. The container exposes port 8088 by default for external access
2. The internal application always runs on port 3001
3. Docker Desktop will automatically map port 8088 to the container

You can verify this mapping in Docker Desktop's port settings for the container.

If you need to change the port mapping after starting the container:
1. Stop the container
2. Edit the port settings in Docker Desktop
3. Restart the container

** Verify Container Status
#+begin_src bash
# Check container is running
docker ps

# View container logs
docker logs meditation
#+end_src

These commands confirm the container is running properly.

** Test Application Functionality
#+begin_src bash
# Simple curl test to verify API is responding
curl http://localhost:8088/api/health
#+end_src

If working correctly, this should return a success response.

** Clean up
After testing and pushing the image we clean up.

#+begin_src bash
# Listing:
docker ps -a
docker stop meditation
docker rm meditation

# Stop and remove all running containers from the test
docker-compose down

# Navigate to the test directory
cd ~/test-meditation-app

# List all files and directories before removal for verification
find .

# Remove the test repository
rm -rf contemplation-machine
rm -rf ./*
pwd

#+end_src


The following listing is an example of removing a file from the git history. This was used for a file that by mistake was added to the git history with sensitive information.

#+begin_src bash
# Listing: remove installation-test.org from git history
cd ~/LocalProjects/ai-bootcamp/meditation-app
git status
git push


# git filter-branch for removing installation-test.org
git filter-branch --force --index-filter "git rm --cached --ignore-unmatch installation-test.org"  --prune-empty --tag-name-filter cat -- --all

## Aufräumen
find .git/refs/original/
rm -rf .git/refs/original/
git reflog expire --expire=now --all
git gc --prune=now --aggressive

## Push to remote
git push origin --force --all
git push origin --force --tags
  
#+end_src


