contemplation-machine-quickstart.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-05-06 Tue 18:51 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Contemplation Machine Quickstart Guide</title>
<meta name="author" content="Your Name" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="assets/toc-nav.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Contemplation Machine Quickstart Guide</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org220a6de">1. Testing Contemplation Machine from Scratch</a>
<ul>
<li><a href="#orgeb1fca3">1.1. Clone and Set Up Environment</a></li>
<li><a href="#orgaa46d3d">1.2. Create a Container for local testing.</a></li>
<li><a href="#orge4fa5a5">1.3. Changing Configuration Without Rebuilding</a></li>
</ul>
</li>
<li><a href="#orgfbe4743">2. Creating Multi-Arch Docker Image</a>
<ul>
<li><a href="#org020fe9e">2.1. Build for Multiple Platforms</a></li>
</ul>
</li>
<li><a href="#org576013e">3. Testing Docker Hub Image via Command Line</a>
<ul>
<li><a href="#org2035c48">3.1. Pull and Run from Docker Hub</a></li>
<li><a href="#org1541278">3.2. Using the Docker Desktop Default Port</a></li>
<li><a href="#org00392ce">3.3. Verify Container Status</a></li>
<li><a href="#org9bdc5fe">3.4. Test Application Functionality</a></li>
<li><a href="#org4d6ca23">3.5. Clean up</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
HTML Version: <a href="contemplation-machine-quickstart.html">contemplation-machine-quickstart.html</a>
</p>
<div id="outline-container-org220a6de" class="outline-2">
<h2 id="org220a6de"><span class="section-number-2">1.</span> Testing Contemplation Machine from Scratch</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgeb1fca3" class="outline-3">
<h3 id="orgeb1fca3"><span class="section-number-3">1.1.</span> Clone and Set Up Environment</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #77492f;"># </span><span style="color: #77492f;">Create a dedicated test directory to avoid conflicts with existing files</span>
mkdir -p ~/test-meditation-app
<span style="color: #8f0075;">cd</span> ~/test-meditation-app
find .

<span style="color: #77492f;"># </span><span style="color: #77492f;">Clone the repository</span>
git clone https://github.com/andreaswittmann/contemplation-machine.git
<span style="color: #77492f;"># </span><span style="color: #77492f;">update the local git repository</span>
<span style="color: #8f0075;">cd</span> ~/test-meditation-app/contemplation-machine
git pull
git status
<span style="color: #77492f;"># </span><span style="color: #77492f;">List the files in the repository</span>
ls -la





<span style="color: #77492f;"># </span><span style="color: #77492f;">Create the environment file from the provided sample</span>
cp .env.sample .env

cat .env
<span style="color: #77492f;"># </span><span style="color: #77492f;">Meditation App Environment Configuration</span>

bash <span style="color: #77492f;"># </span><span style="color: #77492f;">create sub-shell so exports will not affect the current shell</span>
<span style="color: #8f0075;">export</span> <span style="color: #005e8b;">OPENAI_API_KEY</span>=
<span style="color: #8f0075;">export</span> <span style="color: #005e8b;">OPENAI_API_KEY</span>=sk-12345678
<span style="color: #8f0075;">export</span> <span style="color: #005e8b;">ELEVENLABS_API_KEY</span>=
<span style="color: #8f0075;">export</span> <span style="color: #005e8b;">ELEVENLABS_API_KEY</span>=sk-foobarbaz
<span style="color: #8f0075;">export</span> <span style="color: #005e8b;">PORT</span>=8055
<span style="color: #8f0075;">export</span> <span style="color: #005e8b;">HOST</span>=0.0.0.0

<span style="color: #77492f;"># </span><span style="color: #77492f;">create a perl one-liner that replaces the API-Keys with the values of the shell varibales.</span>
perl -pi -e <span style="color: #3548cf;">'s/(OPENAI_API_KEY=).*/$1$ENV{OPENAI_API_KEY}/;'</span> .env
perl -pi -e <span style="color: #3548cf;">'s/(ELEVENLABS_API_KEY=).*/$1$ENV{ELEVENLABS_API_KEY}/;'</span> .env
perl -pi -e <span style="color: #3548cf;">'s/(PORT=).*/$1$ENV{PORT}/;'</span> .env
perl -pi -e <span style="color: #3548cf;">'s/(HOST=).*/$1$ENV{HOST}/;'</span> .env
cat .env 
<span style="color: #531ab6;">exit</span> <span style="color: #77492f;"># </span><span style="color: #77492f;">subshell</span>

<span style="color: #8f0075;">echo</span> <span style="color: #3548cf;">"OPENAI_API_KEY: $OPENAI_API_KEY"</span>
<span style="color: #8f0075;">echo</span> <span style="color: #3548cf;">"ELEVENLABS_API_KEY: $ELEVENLABS_API_KEY"</span>
<span style="color: #8f0075;">echo</span> <span style="color: #3548cf;">"PORT: $PORT"</span>
<span style="color: #8f0075;">echo</span> <span style="color: #3548cf;">"HOST: $HOST"</span>

<span style="color: #77492f;"># </span><span style="color: #77492f;">Display the environment file contents to verify configuration</span>
cat .env



</pre>
</div>

<p>
This clones the repository and creates a basic environment configuration with API keys and port settings.
</p>
</div>
</div>
<div id="outline-container-orgaa46d3d" class="outline-3">
<h3 id="orgaa46d3d"><span class="section-number-3">1.2.</span> Create a Container for local testing.</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Now I want to test the application locally. I will use the settings from the .env file to create a container and run it.
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #77492f;"># </span><span style="color: #77492f;">Build the Docker containers with a clean cache to ensure fresh builds</span>
docker-compose build --no-cache

<span style="color: #77492f;"># </span><span style="color: #77492f;">Start the containers in detached mode to run in the background</span>
docker-compose up -d
docker-compose down --timeout 0


<span style="color: #77492f;"># </span><span style="color: #77492f;">Verify that the containers are running properly</span>
docker ps | grep contemplation-machine


</pre>
</div>
</div>
</div>
<div id="outline-container-orge4fa5a5" class="outline-3">
<h3 id="orge4fa5a5"><span class="section-number-3">1.3.</span> Changing Configuration Without Rebuilding</h3>
<div class="outline-text-3" id="text-1-3">
<p>
You can change API keys or the external port without rebuilding the container:
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #77492f;"># </span><span style="color: #77492f;">Listing: Testing configuration changes through environment.</span>
<span style="color: #77492f;">#  </span><span style="color: #77492f;">Override the PORT when starting the container</span>
docker-compose down --timeout 0
<span style="color: #005e8b;">PORT</span>=9999 docker-compose up -d
<span style="color: #77492f;"># </span><span style="color: #77492f;">Check the application is running on the new port</span>
curl http://localhost:9999/api/health

<span style="color: #77492f;">## </span><span style="color: #77492f;">Change configuration by modifying the .env file</span>
cat .env
<span style="color: #77492f;"># </span><span style="color: #77492f;">Meditation App Environment Configuration</span>

bash <span style="color: #77492f;"># </span><span style="color: #77492f;">create sub-shell so exports will not affect the current shell</span>
<span style="color: #8f0075;">export</span> <span style="color: #005e8b;">OPENAI_API_KEY</span>=
<span style="color: #8f0075;">export</span> <span style="color: #005e8b;">OPENAI_API_KEY</span>=sk-12345678
<span style="color: #8f0075;">export</span> <span style="color: #005e8b;">ELEVENLABS_API_KEY</span>=
<span style="color: #8f0075;">export</span> <span style="color: #005e8b;">ELEVENLABS_API_KEY</span>=sk-foobarbaz
<span style="color: #8f0075;">export</span> <span style="color: #005e8b;">PORT</span>=8055
<span style="color: #8f0075;">export</span> <span style="color: #005e8b;">HOST</span>=0.0.0.0

<span style="color: #77492f;"># </span><span style="color: #77492f;">create a perl one-liner that replaces the API-Keys with the values of the shell varibales.</span>
perl -pi -e <span style="color: #3548cf;">'s/(OPENAI_API_KEY=).*/$1$ENV{OPENAI_API_KEY}/;'</span> .env
perl -pi -e <span style="color: #3548cf;">'s/(ELEVENLABS_API_KEY=).*/$1$ENV{ELEVENLABS_API_KEY}/;'</span> .env
perl -pi -e <span style="color: #3548cf;">'s/(PORT=).*/$1$ENV{PORT}/;'</span> .env
perl -pi -e <span style="color: #3548cf;">'s/(HOST=).*/$1$ENV{HOST}/;'</span> .env
cat .env 
<span style="color: #531ab6;">exit</span> <span style="color: #77492f;"># </span><span style="color: #77492f;">subshell</span>

<span style="color: #77492f;"># </span><span style="color: #77492f;">Restart the container to apply changes</span>
docker-compose down --timeout 0
docker-compose up -d


</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgfbe4743" class="outline-2">
<h2 id="orgfbe4743"><span class="section-number-2">2.</span> Creating Multi-Arch Docker Image</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org020fe9e" class="outline-3">
<h3 id="org020fe9e"><span class="section-number-3">2.1.</span> Build for Multiple Platforms</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">
<pre class="src src-bash">
<span style="color: #77492f;">## </span><span style="color: #77492f;">Store current version form Version.md</span>
ls -la

cat Version.md
<span style="color: #005e8b;">VERSION</span>=$(tr -d <span style="color: #3548cf;">'[:space:]'</span> &lt; Version.md)
<span style="color: #8f0075;">echo</span> $<span style="color: #005e8b;">VERSION</span>

<span style="color: #77492f;"># </span><span style="color: #77492f;">Optional: Display the content of .env to verify the change</span>
cat .env

<span style="color: #77492f;"># </span><span style="color: #77492f;">Log in to Docker Hub</span>
docker login


<span style="color: #77492f;"># </span><span style="color: #77492f;">Set up buildx builder</span>
docker buildx create --name mybuilder --use

<span style="color: #77492f;"># </span><span style="color: #77492f;">Build and push multi-arch image</span>
docker buildx build --platform linux/amd64,linux/arm64   -t awittmann386/contemplation-machine:latest  --push .
docker buildx build --platform linux/amd64,linux/arm64   -t awittmann386/contemplation-machine:$<span style="color: #005e8b;">VERSION</span>  --push .
</pre>
</div>

<p>
This builds Docker images for both AMD64 (standard computers) and ARM64 (Apple Silicon, etc.) architectures and pushes them to Docker Hub.
</p>
</div>
</div>
</div>
<div id="outline-container-org576013e" class="outline-2">
<h2 id="org576013e"><span class="section-number-2">3.</span> Testing Docker Hub Image via Command Line</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org2035c48" class="outline-3">
<h3 id="org2035c48"><span class="section-number-3">3.1.</span> Pull and Run from Docker Hub</h3>
<div class="outline-text-3" id="text-3-1">
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #77492f;"># </span><span style="color: #77492f;">Create data directory for persistence</span>
mkdir -p ./contemplation-data

<span style="color: #77492f;"># </span><span style="color: #77492f;">Create a simple .env file with your API keys and desired port</span>
cat &gt; ~/contemplation-env &lt;&lt; EOF
<span style="color: #3548cf;">OPENAI_API_KEY=your_openai_key_here</span>
<span style="color: #3548cf;">ELEVENLABS_API_KEY=your_elevenlabs_key_here</span>
<span style="color: #3548cf;">PORT=8088</span>
<span style="color: #3548cf;">EOF</span>

<span style="color: #77492f;"># </span><span style="color: #77492f;">Run the container with the .env file mounted</span>
docker run -d <span style="color: #3548cf;">\</span>
  --name meditation <span style="color: #3548cf;">\</span>
  -p 8088:3001 <span style="color: #3548cf;">\</span>
  -v ~/contemplation-data:/app/data <span style="color: #3548cf;">\</span>
  -v ~/contemplation-env:/app/.env <span style="color: #3548cf;">\</span>
  yourusername/contemplation-machine:latest
</pre>
</div>

<p>
The application should now be running and accessible at <a href="http://localhost:8088">http://localhost:8088</a> (or whatever port you specified).
</p>
</div>
</div>
<div id="outline-container-org1541278" class="outline-3">
<h3 id="org1541278"><span class="section-number-3">3.2.</span> Using the Docker Desktop Default Port</h3>
<div class="outline-text-3" id="text-3-2">
<p>
When downloading and running the container from Docker Hub via Docker Desktop:
</p>

<ol class="org-ol">
<li>The container exposes port 8088 by default for external access</li>
<li>The internal application always runs on port 3001</li>
<li>Docker Desktop will automatically map port 8088 to the container</li>
</ol>

<p>
You can verify this mapping in Docker Desktop's port settings for the container.
</p>

<p>
If you need to change the port mapping after starting the container:
</p>
<ol class="org-ol">
<li>Stop the container</li>
<li>Edit the port settings in Docker Desktop</li>
<li>Restart the container</li>
</ol>
</div>
</div>
<div id="outline-container-org00392ce" class="outline-3">
<h3 id="org00392ce"><span class="section-number-3">3.3.</span> Verify Container Status</h3>
<div class="outline-text-3" id="text-3-3">
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #77492f;"># </span><span style="color: #77492f;">Check container is running</span>
docker ps

<span style="color: #77492f;"># </span><span style="color: #77492f;">View container logs</span>
docker logs meditation
</pre>
</div>

<p>
These commands confirm the container is running properly.
</p>
</div>
</div>
<div id="outline-container-org9bdc5fe" class="outline-3">
<h3 id="org9bdc5fe"><span class="section-number-3">3.4.</span> Test Application Functionality</h3>
<div class="outline-text-3" id="text-3-4">
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #77492f;"># </span><span style="color: #77492f;">Simple curl test to verify API is responding</span>
curl http://localhost:8088/api/health
</pre>
</div>

<p>
If working correctly, this should return a success response.
</p>
</div>
</div>
<div id="outline-container-org4d6ca23" class="outline-3">
<h3 id="org4d6ca23"><span class="section-number-3">3.5.</span> Clean up</h3>
<div class="outline-text-3" id="text-3-5">
<p>
After testing and pushing the image we clean up.
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #77492f;"># </span><span style="color: #77492f;">Listing:</span>
docker ps -a
docker stop meditation
docker rm meditation

<span style="color: #77492f;"># </span><span style="color: #77492f;">Stop and remove all running containers from the test</span>
docker-compose down

<span style="color: #77492f;"># </span><span style="color: #77492f;">Navigate to the test directory</span>
<span style="color: #8f0075;">cd</span> ~/test-meditation-app

<span style="color: #77492f;"># </span><span style="color: #77492f;">List all files and directories before removal for verification</span>
find .

<span style="color: #77492f;"># </span><span style="color: #77492f;">Remove the test repository</span>
rm -rf contemplation-machine
rm -rf ./*
<span style="color: #8f0075;">pwd</span>

</pre>
</div>


<p>
The following listing is an example of removing a file from the git history. This was used for a file that by mistake was added to the git history with sensitive information.
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #77492f;"># </span><span style="color: #77492f;">Listing: remove installation-test.org from git history</span>
<span style="color: #8f0075;">cd</span> ~/LocalProjects/ai-bootcamp/meditation-app
git status
git push


<span style="color: #77492f;"># </span><span style="color: #77492f;">git filter-branch for removing installation-test.org</span>
git filter-branch --force --index-filter <span style="color: #3548cf;">"git rm --cached --ignore-unmatch installation-test.org"</span>  --prune-empty --tag-name-filter cat -- --all

<span style="color: #77492f;">## </span><span style="color: #77492f;">Aufr&#228;umen</span>
find .git/refs/original/
rm -rf .git/refs/original/
git reflog expire --expire=now --all
git gc --prune=now --aggressive

<span style="color: #77492f;">## </span><span style="color: #77492f;">Push to remote</span>
git push origin --force --all
git push origin --force --tags

</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2025-05-06 Tue 00:00</p>
<p class="author">Author: Your Name</p>
<p class="date">Created: 2025-05-06 Tue 18:51</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
